duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
		LCD_ShowImage(SYNC_ICON_X, SYNC_ICON_Y, IMG_ID_SYNC_SUCCESS);
		SetLeftKeyUpHandler(ExitSyncDataScreen);
		break;
		
	case SYNC_STATUS_FAIL:
	#ifdef CONFIG_ANIMATION_SUPPORT 
		AnimaStop();
	#endif
	
		LCD_ShowImage(SYNC_ICON_X, SYNC_ICON_Y, IMG_ID_SYNC_FAIL);
		SetLeftKeyUpHandler(ExitSyncDataScreen);
		break;
	}
}

void SyncShowStatus(void)
{
	LCD_Clear(BLACK);
	LCD_ShowImage(SYNC_ICON_X, SYNC_ICON_Y, IMG_ID_SYNV_READY);
	LCD_ShowImage(SYNC_RUNNING_ANI_X, SYNC_RUNNING_ANI_Y, IMG_ID_PROGRASS_ANI_0);
}

void SyncScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SYNC].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SYNC].status = SCREEN_STATUS_CREATED;
		SyncShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		SyncUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_SYNC].act = SCREEN_ACTION_NO;
}
#endif/*CONFIG_SYNC_SUPPORT*/

#ifdef CONFIG_ECG_SUPPORT
void EcgUpdateStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t tmpbuf[128] = {0};
	uint8_t strbuf[64] = {0};

	/*update ecg status*/	
}

// Show ECG lead status in bottom-left corner
void EcgShowLeadStatus(void)
{
	uint16_t x, y, w, h;
	uint8_t tmpbuf[128] = {0};
	const char *status_str;
	
	// Determine status string based on lead status
	switch(g_ecg_lead_status)
	{
		case ECG_LEAD_STATUS_OFF:
			status_str = "off";
			break;
		case ECG_LEAD_STATUS_ON:
			status_str = "on";
			break;
		case ECG_LEAD_STATUS_TIMEOUT:
			status_str = "timeout";
			break;
		default:
			status_str = "";
			break;
	}
	
	// Don't display if status is empty
	if(status_str[0] == '\0')
		return;
	
	// Set font size
#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else
	LCD_SetFontSize(FONT_SIZE_16);
#endif
	
	// Convert to UCS2
	mmi_asc_to_ucs2(tmpbuf, status_str);
	LCD_MeasureUniString(tmpbuf, &w, &h);
	
	// Position in bottom-left corner (adjust coordinates as needed)
	x = 10;  // Left margin
	y = LCD_HEIGHT - h - 5;  // Bottom margin
	
#ifdef LANGUAGE_AR_ENABLE
	if(g_language_r2l)
		LCD_ShowUniStringRtoL(x, y, tmpbuf);
	else
#endif
		LCD_ShowUniString(x, y, tmpbuf);
}

void EcgShowStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t tmpbuf[128] = {0};

	if(g_ecg_display_phase == ECG_DISPLAY_PREPARE)
	{
		// Show heart icon in center (reference HR screen)
		LCD_ShowImage(ECG_PREPARE_ICON_X, ECG_PREPARE_ICON_Y, IMG_ID_HR_ANI_2);

		// Show "ECG" text at bottom
		LCD_SetFontSize(FONT_SIZE_36);

		LCD_MeasureUniStr(STR_ID_MAIN_MENU_ECG, &w, &h);
#ifdef LANGUAGE_AR_ENABLE
		if(g_language_r2l)
			LCD_ShowUniStrRtoL(HR_NOTIFY_X+(HR_NOTIFY_W+w)/2, ECG_PREPARE_STR_Y, STR_ID_MAIN_MENU_ECG);
		else
#endif
			LCD_ShowUniStr(HR_NOTIFY_X+(HR_NOTIFY_W-w)/2, ECG_PREPARE_STR_Y, STR_ID_MAIN_MENU_ECG);
			
			// Show hint text at screen bottom (two lines)
			LCD_SetFontSize(FONT_SIZE_28);
			{
				uint8_t *line1 = (uint8_t *)"Please place your finger";
				uint8_t *line2 = (uint8_t *)"on the metal plate.";
				uint16_t w1, h1, w2, h2;
				POINT_COLOR = WHITE;
				LCD_MeasureString(line1, &w1, &h1);
				LCD_MeasureString(line2, &w2, &h2);
				LCD_ShowString((LCD_WIDTH - w1) / 2, LCD_HEIGHT - h1 - h2 - 55, line1);
				LCD_ShowString((LCD_WIDTH - w2) / 2, LCD_HEIGHT - h2 - 50, line2);
			}
	}
	else
	{
		// Waveform mode - clear status area
  #ifdef FONTMAKER_UNICODE_FONT
		LCD_SetFontSize(FONT_SIZE_28);
  #else
		LCD_SetFontSize(FONT_SIZE_24);
  #endif

		mmi_asc_to_ucs2(tmpbuf, "");
		LCD_MeasureUniString(tmpbuf, &w, &h);
#ifdef LANGUAGE_AR_ENABLE
		if(g_language_r2l)
			LCD_ShowUniStringRtoL(BP_NOTIFY_X+(BP_NOTIFY_W+w)/2, BP_NOTIFY_Y, tmpbuf);
		else
#endif
			LCD_ShowUniString(BP_NOTIFY_X+(BP_NOTIFY_W-w)/2, BP_NOTIFY_Y, tmpbuf);
	}
}

// ECG波形显示区域定义
#define ECG_WAVE_X_START    GRID_X_START        // 波形起始X与网格左边界对齐
#define ECG_WAVE_X_END      (LCD_WIDTH - 15)
#define ECG_WAVE_Y_START    75                  // 波形区域与网格顶部对??
#define ECG_WAVE_HEIGHT     285                 // 波形区域高度与网格一??
#define ECG_WAVE_COLOR      RED
#define ECG_SAMPLES_PER_PACKET  32                  // 每包采样点数（0.25秒数据，32个int16_t）
#define ECG_DATA_PACKET_SIZE    (ECG_SAMPLES_PER_PACKET * sizeof(int16_t))  // 64字节
#define GRID_SMALL_COLOR    GRAY
#define SMALL_GRID_SIZE     20                  // 小网格尺寸（格子内宽??
#define GRID_LINE_WIDTH     2                   // 网格线宽??

// 屏幕尺寸：宽390 x 高450
// 顶部预留15%空间：450 * 0.15 = 67.5 ≈ 68像素，取整后75像素
// 底部预留20%空间：450 * 0.2 = 90像素
// 网格可用高度：450 - 75 - 90 = 285像素
// Y方向：19个格子，每个格子13像素 + 20条线各2像素 = 247 + 40 = 287 ≈ 285
// X方向：24个格子，每个格子13像素 + 25条线各2像素 = 312 + 50 = 362 ≈ 360
#define GRID_CELLS_Y        13                  // Y方向13个格??
#define GRID_CELLS_X        16                  // X方向16个格??
#define GRID_PIXEL_HEIGHT   (GRID_CELLS_Y * SMALL_GRID_SIZE + (GRID_CELLS_Y + 1) * GRID_LINE_WIDTH)  // 287
#define GRID_PIXEL_WIDTH    (GRID_CELLS_X * SMALL_GRID_SIZE + (GRID_CELLS_X + 1) * GRID_LINE_WIDTH)  // 362
// 网格起始位置
#define GRID_Y_START        75                  // 顶部预留75像素
#define GRID_X_START        14                  // 左右边距14像素，使网格居中
// 网格结束位置
#define GRID_Y_END          (GRID_Y_START + GRID_PIXEL_HEIGHT - 1)  // 361
#define GRID_X_END          (GRID_X_START + GRID_PIXEL_WIDTH - 1)    // 375

// ECG数据环形缓冲区
#define ECG_LOCAL_BUFFER_SIZE  512
static int16_t ecg_local_buffer[ECG_LOCAL_BUFFER_SIZE];
static volatile uint16_t ecg_local_read_idx = 0;
static volatile uint16_t ecg_local_write_idx = 0;
static volatile bool ecg_local_buffer_full = false;
// ECG绘制使能标志，用于ExitEcgScreen时立即阻断正在进行的EcgDisplayProcessData
static volatile bool g_ecg_display_active = false;

// 波形绘制状态
static uint16_t s_ecg_wave_x = ECG_WAVE_X_START;
static uint16_t s_ecg_prev_y = ECG_WAVE_Y_START + ECG_WAVE_HEIGHT / 2;
static uint16_t s_ecg_prev_x = ECG_WAVE_X_START;

// 用于记录上一轮波形每个位置的 y 值，以便新一轮清除旧波形
// 数组索引 = (x - GRID_X_START) / 2，0xFFFF表示该位置无波形
#define ECG_WAVE_HISTORY_SIZE  ((GRID_PIXEL_WIDTH / 2) + 1)  // 178
static uint16_t ecg_wave_y_history[ECG_WAVE_HISTORY_SIZE];         // 当前点的y值
static uint16_t ecg_wave_prev_x_history[ECG_WAVE_HISTORY_SIZE];    // 起点的x值，用于精确清除线段
static uint16_t ecg_wave_prev_y_history[ECG_WAVE_HISTORY_SIZE];    // 起点的y值，用于清除线段
#define ECG_WAVE_Y_INVALID  0xFFFF

