duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
// ECG倒计时显??
static uint8_t s_ecg_countdown_seconds = 60;
static bool s_ecg_countdown_first_show = true;
static void EcgCountdownTimerCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(ecg_countdown_timer, EcgCountdownTimerCallBack, NULL);
#define ECG_COUNTDOWN_Y     (GRID_Y_END + 10)   // 倒计时显示位置（网格下方??

// 网格列模板预计算
// 周期 = SMALL_GRID_SIZE + GRID_LINE_WIDTH = 13 + 2 = 15
#define ECG_GRID_STRIPE_PERIOD  (SMALL_GRID_SIZE + GRID_LINE_WIDTH)  // 15
// 每列模板高度多2行，防止LCD_DrawLine斜线在GRID_Y_END+1处残留
// +2而非+1：屏幕硬件要2像素对齐，起始y=75(奇)+高度290(偶)=结束y=364(偶)
// 硬件已确保波形在y=362时的下半2x2(y=363)能被彻底清除
#define ECG_GRID_COL_HEIGHT     (GRID_PIXEL_HEIGHT + 2)              // 290
// 每个模板 1 列 * ECG_GRID_COL_HEIGHT * 2 字节
static uint8_t ecg_col_templates[ECG_GRID_STRIPE_PERIOD][ECG_GRID_COL_HEIGHT * 2];
static bool ecg_col_templates_ready = false;

// 在 EcgDisplayInit 时调用，预计算所有 15 种列模板
static void EcgPrecomputeColTemplates(void)
{
    const uint16_t GRAY_H  = GRID_SMALL_COLOR >> 8;
    const uint16_t GRAY_L  = GRID_SMALL_COLOR & 0xFF;
    const uint16_t BLACK_H = BLACK >> 8;
    const uint16_t BLACK_L = BLACK & 0xFF;

    for (uint16_t xp = 0; xp < ECG_GRID_STRIPE_PERIOD; xp++) {
        bool is_vcol = (xp < GRID_LINE_WIDTH);  // 该列是否为竖线
        uint8_t *tmpl = ecg_col_templates[xp];
        uint32_t idx = 0;

        for (uint16_t y = 0; y < ECG_GRID_COL_HEIGHT; y++) {
            uint16_t color_h, color_l;
            if (y < GRID_PIXEL_HEIGHT) {
                // 在网格有效高度内
                uint16_t yp = y % ECG_GRID_STRIPE_PERIOD;
                bool is_hrow = (yp < GRID_LINE_WIDTH);  // 该行是否为横线
                if (is_vcol || is_hrow) {
                    color_h = GRAY_H;
                    color_l = GRAY_L;
                } else {
                    color_h = BLACK_H;
                    color_l = BLACK_L;
                }
            } else {
                // 超出网格底部的1行：黑色（覆盖斜线残留）
                color_h = BLACK_H;
                color_l = BLACK_L;
            }
            tmpl[idx++] = color_h;
            tmpl[idx++] = color_l;
        }
    }
    ecg_col_templates_ready = true;
}

// 快速恢复指定列的网格（清除旧波形，恢复网格背景）
// 固定恢复宽度为 2 列，直接拼接两个预计算模板，一次 SPI 刷新
#define ECG_RESTORE_COL_WIDTH  2
static void RestoreGridColumns(uint16_t x, uint16_t width)
{
    (void)width;  // 固定宽度 2，忽略参数

    if (!ecg_col_templates_ready) {
        return;
    }
    if (x + ECG_RESTORE_COL_WIDTH > ECG_WAVE_X_END + 1) {
        return;
    }

    // 拼合两列模板到静态发送缓冲区（交错写入：每行先col0再col1）
    static uint8_t data_buf[ECG_RESTORE_COL_WIDTH * ECG_GRID_COL_HEIGHT * 2];

    uint16_t xp0 = (x     - GRID_X_START) % ECG_GRID_STRIPE_PERIOD;
    uint16_t xp1 = (x + 1 - GRID_X_START) % ECG_GRID_STRIPE_PERIOD;
    const uint8_t *t0 = ecg_col_templates[xp0];
    const uint8_t *t1 = ecg_col_templates[xp1];

    // LCD 行优先扫描：每行依次为 col0、col1
    uint32_t src = 0, dst = 0;
    for (uint16_t y = 0; y < ECG_GRID_COL_HEIGHT; y++) {
        data_buf[dst++] = t0[src];
        data_buf[dst++] = t0[src + 1];
        data_buf[dst++] = t1[src];
        data_buf[dst++] = t1[src + 1];
        src += 2;
    }

    BlockWrite(x, GRID_Y_START, ECG_RESTORE_COL_WIDTH, ECG_GRID_COL_HEIGHT);
    DispData(ECG_RESTORE_COL_WIDTH * ECG_GRID_COL_HEIGHT * 2, data_buf);
}

// 恢复单个波形点的网格背景（2x2像素）
// 对每个像素分别判断是否在网格线上，恢复为相应颜色
static void RestoreGridPoint(uint16_t x, uint16_t y)
{
    // 边界检查（允许2x2像素块覆盖到GRID_Y_END+1，因为屏幕需要2像素对齐）
    if (x < GRID_X_START || x + 1 > GRID_X_END || y < GRID_Y_START || y > GRID_Y_END) {
        return;
    }
    
    // 准备4个像素的颜色数据（RGB565，每个像素2字节）
    uint8_t data_buf[8];  // 2x2 * 2字节 = 8字节
    uint16_t idx = 0;
    
    // 按行优先顺序填充4个像素的颜色
    for (uint16_t dy = 0; dy < 2; dy++) {
        for (uint16_t dx = 0; dx < 2; dx++) {
            uint16_t px = x + dx;
            uint16_t py = y + dy;
            
            // 计算该像素在网格周期中的位置
            uint16_t xp = (px - GRID_X_START) % ECG_GRID_STRIPE_PERIOD;
            uint16_t yp = (py - GRID_Y_START) % ECG_GRID_STRIPE_PERIOD;
            
            // 判断是否在网格线上
            bool is_vcol = (xp < GRID_LINE_WIDTH);  // 是否在竖线上
            bool is_hrow = (yp < GRID_LINE_WIDTH);  // 是否在横线上
            
            uint16_t color;
            if (is_vcol || is_hrow) {
                color = GRID_SMALL_COLOR;  // 在网格线上
            } else {
                color = BLACK;  // 不在网格线上
            }
            
            // RGB565 高字节在前
            data_buf[idx++] = color >> 8;
            data_buf[idx++] = color & 0xFF;
        }
    }
    
    // 一次性写入2x2区域
    BlockWrite(x, y, 2, 2);
    DispData(8, data_buf);
}


// 批量清除的分块大小（每次处理4列，约2.3KB缓冲区）
#define ECG_BATCH_CHUNK_COLUMNS  4

// 批量清除多列网格背景（分块处理，避免大缓冲区）
static void EcgBatchRestoreColumns(uint16_t start_x, uint16_t width)
{
    if (!ecg_col_templates_ready || width == 0) {
        return;
    }
    
    // 边界检查
    if (start_x < GRID_X_START || start_x + width > GRID_X_END + 1) {
        return;
    }
    
    // 使用静态缓冲区存储单块数据（4列 * 288行 * 2字节 = 2,304字节）
    static uint8_t chunk_buf[ECG_BATCH_CHUNK_COLUMNS * ECG_GRID_COL_HEIGHT * 2];
    
    // 分块处理
    uint16_t processed = 0;
    while (processed < width) {
        uint16_t chunk_width = width - processed;
        if (chunk_width > ECG_BATCH_CHUNK_COLUMNS) {
            chunk_width = ECG_BATCH_CHUNK_COLUMNS;
        }
        
        uint16_t cur_x = start_x + processed;
        uint32_t dst_idx = 0;
        
        // 按行交织写入：每行依次写入当前块的所有列
        for (uint16_t y = 0; y < ECG_GRID_COL_HEIGHT; y++) {
            for (uint16_t col = 0; col < chunk_width; col++) {
                uint16_t x = cur_x + col;
                uint16_t xp = (x - GRID_X_START) % ECG_GRID_STRIPE_PERIOD;
                const uint8_t *tmpl = ecg_col_templates[xp];
                
                chunk_buf[dst_idx++] = tmpl[y * 2];
                chunk_buf[dst_idx++] = tmpl[y * 2 + 1];
            }
        }
        
        // 写入当前块
        BlockWrite(cur_x, GRID_Y_START, chunk_width, ECG_GRID_COL_HEIGHT);
        DispData(chunk_width * ECG_GRID_COL_HEIGHT * 2, chunk_buf);
        
        processed += chunk_width;
    }
}

// 批量绘制波形线段结构
typedef struct {
    uint16_t x1, y1;  // 起点
    uint16_t x2, y2;  // 终点
} EcgLineSegment;


// 由于旧波形已批量清除，这里只需绘制新波形
static void EcgBatchDrawWaveSegments(EcgLineSegment *segments, uint16_t count, uint16_t color)
{
    if (count == 0) return;
    
    POINT_COLOR = color;
    
