duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
    // 直接逐条线段绘制
    for (uint16_t seg = 0; seg < count; seg++) {
        LCD_DrawLine(segments[seg].x1, segments[seg].y1, 
                     segments[seg].x2, segments[seg].y2);
    }
}

// 恢复一条线段上所有点的网格背景（用于清除上一条波形线）
// 使用与 LCD_DrawLine 相同的 Bresenham 算法遍历所有点
static void RestoreGridLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
    uint16_t t;
    int xerr = 0, yerr = 0, delta_x, delta_y, distance;
    int incx, incy, uRow, uCol;
    
    delta_x = x2 - x1;
    delta_y = y2 - y1;
    uRow = x1;
    uCol = y1;
    
    if (delta_x > 0) incx = 1;
    else if (delta_x == 0) incx = 0;
    else { incx = -1; delta_x = -delta_x; }
    
    if (delta_y > 0) incy = 1;
    else if (delta_y == 0) incy = 0;
    else { incy = -1; delta_y = -delta_y; }
    
    if (delta_x > delta_y) distance = delta_x;
    else distance = delta_y;
    
    // 遍历线段上的所有点并恢复网格
    for (t = 0; t <= distance + 1; t++) {
        // 确保每个点都画 2x2 区域，需要每隔 2 像素调用一次
        // 但要保证覆盖整个线段，所以每个点都要处理
        RestoreGridPoint(uRow, uCol);
        
        xerr += delta_x;
        yerr += delta_y;
        if (xerr > distance) {
            xerr -= distance;
            uRow += incx;
        }
        if (yerr > distance) {
            yerr -= distance;
            uCol += incy;
        }
    }
    
    // 额外处理终点，防止 Bresenham 算法遗漏
    // 因为循环条件是 t <= distance+1，可能会多走一步
    if (uRow != x2 || uCol != y2) {
        RestoreGridPoint(x2, y2);
    }
}

// ECG 波形快速绘制开关：1=两列 FillColor（每段 2 次 BlockWrite），0=原 Bresenham LCD_DrawLine
// 适用前提：ECG segment 的 x 跨度固定 = 2（s_ecg_wave_x += 2）
#define ECG_FAST_DRAW_LINE  1

// ECG 波形动画节拍：每画完一段 segment 后的延时 (ms)
// 5340 每 0.25s 推 32 点 → 32 × 7ms ≈ 224ms，和数据到达节拍匹配，视觉上波形“连续流动”
// 改小 = 更快更近闪现；改大 = 更慢，当大于 7-8ms 时要注意不要超过 250ms 导致数据积压
// 注意：值过小（<=5ms）会导致绝大多数时间空闲，UART/屏幕事件与其它任务竞争反而容易积压
#define ECG_RENDER_INTERVAL_MS  7

#if ECG_FAST_DRAW_LINE
// 用两列垂直段拼接替代 Bresenham：在 x1 列画 y1→y_mid，在 x2 列画 y_mid→y2
// 每段仅 2 次 BlockWrite，相比原 ~21 次有显著提速（并口 LCD 每次 BlockWrite 约 89 次 GPIO）
// 注：本屏幕“打点必须占 2 像素”，所以每列宽度固定用 2（与原 LCD_Fast_DrawPoint 2x2 行为一致）
static void EcgDrawWaveSegment(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
    uint16_t y_mid  = (uint16_t)(((uint32_t)y1 + (uint32_t)y2) >> 1);
    uint16_t a_top  = (y1 < y_mid) ? y1 : y_mid;
    uint16_t a_span = ((y1 < y_mid) ? (y_mid - y1) : (y1 - y_mid)) + 1;
    uint16_t b_top  = (y_mid < y2) ? y_mid : y2;
    uint16_t b_span = ((y_mid < y2) ? (y2 - y_mid) : (y_mid - y2)) + 1;
    LCD_FillColor(x1, a_top, 2, a_span, ECG_WAVE_COLOR);
    LCD_FillColor(x2, b_top, 2, b_span, ECG_WAVE_COLOR);
}
// #define ECG_WAVE_DRAWLINE(x1, y1, x2, y2)  EcgDrawWaveSegment((x1), (y1), (x2), (y2))
// #else
#define ECG_WAVE_DRAWLINE(x1, y1, x2, y2)  LCD_DrawLine((x1), (y1), (x2), (y2))
#endif

// 动态显示 ECG 波形（不清屏，只清除当前位置的旧波形）
static void DisplayDynamicECGPoint(int16_t value)
{
    // Y 轴映射 - 使用宏定义的网格区域

    // Y 轴范围
    const int16_t min_value = -5000, max_value = 5000;
    if (value < min_value) value = min_value;
    if (value > max_value) value = max_value;

    int range = max_value - min_value;
    if (range == 0) range = 1;

    uint16_t y = GRID_Y_START + GRID_PIXEL_HEIGHT - 
                 (uint16_t)(((int32_t)(value - min_value) * GRID_PIXEL_HEIGHT) / range);
    
    // 限制 Y 坐标在显示区间内
    if (y < GRID_Y_START) y = GRID_Y_START;
    if (y > GRID_Y_END) y = GRID_Y_END;

    /* 加锁：保证整个"清除旧点+画新点"是原子操作，不被主线程插入 */
    //LCD_Lock();
    
    // 若到达右边界 → 重新从左边开始（不清屏）
    if (s_ecg_wave_x > GRID_X_END) {
        s_ecg_wave_x = GRID_X_START;
        s_ecg_prev_x = s_ecg_wave_x;
        s_ecg_prev_y = (GRID_Y_START + GRID_Y_END) / 2;
    }

    // 计算当前位置的索引
    uint16_t idx = (s_ecg_wave_x - GRID_X_START) / 2;
    
    // 检查该位置是否有上一轮的旧波形，如果有则清除
    if (idx < ECG_WAVE_HISTORY_SIZE && 
        ecg_wave_y_history[idx] != ECG_WAVE_Y_INVALID &&
        ecg_wave_prev_y_history[idx] != ECG_WAVE_Y_INVALID) {
        // 清除旧的波形线段（使用记录的精确端点）
        RestoreGridLine(ecg_wave_prev_x_history[idx], ecg_wave_prev_y_history[idx], 
                        s_ecg_wave_x, ecg_wave_y_history[idx]);
    }

    // 设置画笔颜色为红色并画新线段
    POINT_COLOR = ECG_WAVE_COLOR;
    LCD_DrawLine(s_ecg_prev_x, s_ecg_prev_y, s_ecg_wave_x, y);

    //LCD_Unlock();

    // 保存当前位置的y值到历史数组（供下一轮清除使用）
    if (idx < ECG_WAVE_HISTORY_SIZE) {
        ecg_wave_prev_x_history[idx] = s_ecg_prev_x;  // 记录起点x坐标
        ecg_wave_prev_y_history[idx] = s_ecg_prev_y;  // 记录起点y坐标
        ecg_wave_y_history[idx] = y;                   // 记录终点y坐标
    }

    // 更新位置
    s_ecg_prev_x = s_ecg_wave_x;
    s_ecg_prev_y = y;
    s_ecg_wave_x += 2;
}

// ECG数据显示函数 - 接收64字节数据并批量绘制波形
void EcgDisplayProcessData(const uint8_t *data, uint16_t length)
{
    // 不在ECG界面或ECG已退出时不绘制
    if (screen_id != SCREEN_ID_ECG || !g_ecg_display_active) {
        return;
    }

    // 验证输入参数
    if (data == NULL || length != ECG_DATA_PACKET_SIZE) {
        LOGD("Invalid ECG data: data=%p, length=%d", data, length);
        return;
    }
    
    // 用于收集绘制的线段
    static EcgLineSegment segments[ECG_SAMPLES_PER_PACKET];
    static uint16_t seg_count;
    
    // 记录每个 idx 对应的 segment 索引（用于边清除边绘制）
    static uint8_t idx_to_seg[ECG_WAVE_HISTORY_SIZE];
    memset(idx_to_seg, 0xFF, sizeof(idx_to_seg));  // 0xFF 表示无对应线段
    
    seg_count = 0;
    
    // 需要清除的列（用位数组标记，每个idx对应2列）
    static uint8_t clear_mask[(ECG_WAVE_HISTORY_SIZE + 7) / 8];
    memset(clear_mask, 0, sizeof(clear_mask));
    uint16_t clear_count = 0;
    
    // 第一步：解析所有数据点，收集需要清除的列和绘制线段
    for (int i = 0; i < ECG_SAMPLES_PER_PACKET; i++) {
        int16_t value = (int16_t)((uint16_t)data[i * 2] | ((uint16_t)data[i * 2 + 1] << 8));
        
        // Y 轴映射
        const int16_t min_value = -6000, max_value = 6000;
        if (value < min_value) value = min_value;
        if (value > max_value) value = max_value;

        int range = max_value - min_value;
        if (range == 0) range = 1;

        uint16_t y = GRID_Y_START + GRID_PIXEL_HEIGHT - 
                     (uint16_t)(((int32_t)(value - min_value) * GRID_PIXEL_HEIGHT) / range);
        
