duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
        if (y < GRID_Y_START) y = GRID_Y_START;
        if (y > GRID_Y_END) y = GRID_Y_END;

        // 若到达右边界 → 重新从左边开始
        if (s_ecg_wave_x > GRID_X_END) {
            s_ecg_wave_x = GRID_X_START;
            s_ecg_prev_x = s_ecg_wave_x;
            s_ecg_prev_y = (GRID_Y_START + GRID_Y_END) / 2;
        }

        uint16_t idx = (s_ecg_wave_x - GRID_X_START) / 2;
        
        // 标记需要清除的列（如果该位置有旧波形）
        if (idx < ECG_WAVE_HISTORY_SIZE &&
            ecg_wave_y_history[idx] != ECG_WAVE_Y_INVALID &&
            ecg_wave_prev_y_history[idx] != ECG_WAVE_Y_INVALID) {
            // 只标记当前位置，不计算线段范围
            if (!(clear_mask[idx / 8] & (1 << (idx % 8)))) {
                clear_mask[idx / 8] |= (1 << (idx % 8));
                clear_count++;
            }
        }
        
        // 收集绘制线段
        if (seg_count < ECG_SAMPLES_PER_PACKET) {
            segments[seg_count].x1 = s_ecg_prev_x;
            segments[seg_count].y1 = s_ecg_prev_y;
            segments[seg_count].x2 = s_ecg_wave_x;
            segments[seg_count].y2 = y;
            
            // 记录 idx 到 segment 的映射
            if (idx < ECG_WAVE_HISTORY_SIZE) {
                idx_to_seg[idx] = seg_count;
            }
            seg_count++;
        }
        
        // 更新历史记录
        if (idx < ECG_WAVE_HISTORY_SIZE) {
            ecg_wave_prev_x_history[idx] = s_ecg_prev_x;
            ecg_wave_prev_y_history[idx] = s_ecg_prev_y;
            ecg_wave_y_history[idx] = y;
        }

        // 更新位置
        s_ecg_prev_x = s_ecg_wave_x;
        s_ecg_prev_y = y;
        s_ecg_wave_x += 2;
    }
    
    // 第二步：边清除边绘制（合并相邻idx为4列批量清除，减少SPI通讯次数）
    POINT_COLOR = ECG_WAVE_COLOR;
    for (uint16_t idx = 0; idx < ECG_WAVE_HISTORY_SIZE; idx++) {
        bool cur_clear = (clear_mask[idx / 8] & (1 << (idx % 8))) != 0;
        if (!cur_clear) continue;

        uint16_t x = GRID_X_START + idx * 2;

        // 检查下一个idx是否也需要清除，且4列不超出边界
        bool next_clear = false;
        if ((idx + 1) < ECG_WAVE_HISTORY_SIZE && (x + 4) <= (GRID_X_END + 1)) {
            next_clear = (clear_mask[(idx + 1) / 8] & (1 << ((idx + 1) % 8))) != 0;
        }

        if (next_clear) {
            // 合并：4列一次清除，节省一次BlockWrite命令
            EcgBatchRestoreColumns(x, 4);

            // 绘制当前位置的线段
            if (idx_to_seg[idx] != 0xFF) {
                uint8_t seg_idx = idx_to_seg[idx];
                ECG_WAVE_DRAWLINE(segments[seg_idx].x1, segments[seg_idx].y1,
                                  segments[seg_idx].x2, segments[seg_idx].y2);
                //k_sleep(K_MSEC(ECG_RENDER_INTERVAL_MS));  // 流动动画节拍
                // 状态变化（导联脱落 / 退出 ECG）时立即停绘，避免阻塞事件处理
                if (screen_id != SCREEN_ID_ECG || !g_ecg_display_active ||
                    g_ecg_lead_status != ECG_LEAD_STATUS_ON) {
                    return;
                }
            }

            // 绘制下一个位置的线段
            if (idx_to_seg[idx + 1] != 0xFF) {
                uint8_t seg_idx = idx_to_seg[idx + 1];
                ECG_WAVE_DRAWLINE(segments[seg_idx].x1, segments[seg_idx].y1,
                                  segments[seg_idx].x2, segments[seg_idx].y2);
							k_sleep(K_MSEC(2));
                //k_sleep(K_MSEC(ECG_RENDER_INTERVAL_MS));  // 流动动画节拍
                if (screen_id != SCREEN_ID_ECG || !g_ecg_display_active ||
                    g_ecg_lead_status != ECG_LEAD_STATUS_ON) {
                    return;
                }
            }

            idx++;  // 跳过已处理的下一个idx
        } else {
            // 单独：2列清除
            EcgBatchRestoreColumns(x, 2);

            // 绘制当前位置的线段
            if (idx_to_seg[idx] != 0xFF) {
                uint8_t seg_idx = idx_to_seg[idx];
                ECG_WAVE_DRAWLINE(segments[seg_idx].x1, segments[seg_idx].y1,
                                  segments[seg_idx].x2, segments[seg_idx].y2);
                //k_sleep(K_MSEC(ECG_RENDER_INTERVAL_MS));  // 流动动画节拍
                if (screen_id != SCREEN_ID_ECG || !g_ecg_display_active ||
                    g_ecg_lead_status != ECG_LEAD_STATUS_ON) {
                    return;
                }
            }
        }

    
    }
        
    // 第三步：绘制未被清除位置的线段（新位置，无旧波形需要清除）
    for (uint16_t seg = 0; seg < seg_count; seg++) {
        // 找到该线段对应的 idx
        uint16_t x2 = segments[seg].x2;
        uint16_t idx = (x2 - GRID_X_START) / 2;
            
        // 如果该位置没有被清除过，说明是新位置，需要绘制
        if (idx < ECG_WAVE_HISTORY_SIZE && 
            !(clear_mask[idx / 8] & (1 << (idx % 8)))) {
            ECG_WAVE_DRAWLINE(segments[seg].x1, segments[seg].y1,
                              segments[seg].x2, segments[seg].y2);
            //k_sleep(K_MSEC(ECG_RENDER_INTERVAL_MS));  // 流动动画节拍
            if (screen_id != SCREEN_ID_ECG || !g_ecg_display_active ||
                g_ecg_lead_status != ECG_LEAD_STATUS_ON) {
                return;
            }
        }
            
    }
        
}

// ECG倒计时显示函数 - 只更新数字部分
static void EcgShowCountdown(void)
{
    uint8_t strbuf[32];
    uint8_t prefix[] = "Testing Wait ";
    uint16_t prefix_w, prefix_h;
    uint16_t num_w, num_h;
    uint16_t total_w, h;
    uint16_t start_x;
    
    // 测量前缀宽度
    LCD_MeasureString(prefix, &prefix_w, &prefix_h);
    
    if (s_ecg_countdown_first_show) {
        // 第一次显示完整文本
        LCD_Fill(0, ECG_COUNTDOWN_Y, LCD_WIDTH, 30, BLACK);
        if (s_ecg_countdown_seconds > 0) {
            sprintf(strbuf, "Testing Wait %ds", s_ecg_countdown_seconds);
        } else {
            sprintf(strbuf, "Testing Complete");
        }
        LCD_MeasureString(strbuf, &total_w, &h);
        POINT_COLOR = WHITE;
        LCD_ShowString((LCD_WIDTH - total_w) / 2, ECG_COUNTDOWN_Y, strbuf);
        s_ecg_countdown_first_show = false;
    } else {
        // 后续只更新数字部分
        if (s_ecg_countdown_seconds > 0) {
            // 计算数字区域的X坐标（居中）
            sprintf(strbuf, "%d", s_ecg_countdown_seconds);
            LCD_MeasureString(strbuf, &num_w, &num_h);
            total_w = prefix_w + num_w + 9; // 8+"s"的宽度估算
            start_x = (LCD_WIDTH - total_w) / 2 + prefix_w;
            
            // 清除固定宽度的数字区域（足以覆盖"60s"的最大宽度）
            // 测量"60s"的宽度作为最大清除区域
            uint16_t max_num_w, max_h;
            LCD_MeasureString("60s", &max_num_w, &max_h);
            LCD_Fill(start_x - 2, ECG_COUNTDOWN_Y, max_num_w + 4, prefix_h, BLACK);
            
            // 只显示数字和"s"
            POINT_COLOR = WHITE;
            sprintf(strbuf, "%ds", s_ecg_countdown_seconds);
            LCD_ShowString(start_x, ECG_COUNTDOWN_Y, strbuf);
        } else {
            // 倒计时结束，显示完成文本
            LCD_Fill(0, ECG_COUNTDOWN_Y, LCD_WIDTH, 30, BLACK);
            sprintf(strbuf, "Testing Complete");
            LCD_MeasureString(strbuf, &total_w, &h);
            POINT_COLOR = WHITE;
            LCD_ShowString((LCD_WIDTH - total_w) / 2, ECG_COUNTDOWN_Y, strbuf);
        }
    }
    
    LCD_SetFontSize(FONT_SIZE_20);
    POINT_COLOR = WHITE;

    sprintf(strbuf, "HR:%d", g_ecg_health_data.hr);
    LCD_MeasureString(strbuf, &num_w, &num_h);
    uint16_t hr_x = 40;
    uint16_t hr_y = LCD_HEIGHT - num_h - 25;
    LCD_Fill(hr_x - 5, hr_y, num_w + 10, num_h + 5, BLACK);
    LCD_ShowString(hr_x, hr_y, strbuf);

    sprintf(strbuf, "HRV:%d", g_ecg_health_data.hrv);
    LCD_MeasureString(strbuf, &num_w, &num_h);
    uint16_t hrv_x = LCD_WIDTH - num_w - 50;
    uint16_t hrv_y = LCD_HEIGHT - num_h - 25;
    LCD_Fill(hrv_x - 5, hrv_y, num_w + 10, num_h + 5, BLACK);
    LCD_ShowString(hrv_x, hrv_y, strbuf);
}

// 初始化ECG显示
void EcgDisplayInit(void)
{
    // 预计算网格列模板（仅在模板未就绪时执行，避免重复计算??
    if (!ecg_col_templates_ready) {
        EcgPrecomputeColTemplates();
    }

    // 绘制网格背景
    EcgDrawGrid();
    
    // 初始化波形绘制位置
    s_ecg_wave_x = GRID_X_START;
    s_ecg_prev_x = s_ecg_wave_x;
    s_ecg_prev_y = (GRID_Y_START + GRID_Y_END) / 2;
    
