duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
    // 初始化波形历史数组（全部设为无效）
    for (uint16_t i = 0; i < ECG_WAVE_HISTORY_SIZE; i++) {
        ecg_wave_y_history[i] = ECG_WAVE_Y_INVALID;
        ecg_wave_prev_x_history[i] = ECG_WAVE_Y_INVALID;
        ecg_wave_prev_y_history[i] = ECG_WAVE_Y_INVALID;
    }
    
    // 初始化并显示倒计??
    s_ecg_countdown_seconds = 30;
    s_ecg_countdown_first_show = true;
    EcgShowCountdown();
    
    // 启动倒计时定时器（每秒更新一次）
    k_timer_start(&ecg_countdown_timer, K_SECONDS(1), K_SECONDS(1));
    
    //LOGD("ECG display initialized");
}

void EcgDisplayDeinit(void)
{
    // 恢复默认颜色，避免影响其他界面
    POINT_COLOR = WHITE;
    BACK_COLOR = BLACK;
    
    //LOGD("ECG display deinitialized");
}

void EcgDrawGrid(void)
{
    // 1. 先填充整个网格区域为黑色背景
    //LCD_FillColor(GRID_X_START, GRID_Y_START, GRID_PIXEL_WIDTH, GRID_PIXEL_HEIGHT, BLACK);
    
    // 2. 画水平网格线
    for (uint8_t row = 0; row <= GRID_CELLS_Y; row++) {
        uint16_t y = GRID_Y_START + row * (SMALL_GRID_SIZE + GRID_LINE_WIDTH);
        LCD_FillColor(GRID_X_START, y, GRID_PIXEL_WIDTH, GRID_LINE_WIDTH, GRID_SMALL_COLOR);
    }
    
    // 3. 画垂直网格线
    for (uint8_t col = 0; col <= GRID_CELLS_X; col++) {
        uint16_t x = GRID_X_START + col * (SMALL_GRID_SIZE + GRID_LINE_WIDTH);
        LCD_FillColor(x, GRID_Y_START, GRID_LINE_WIDTH, GRID_PIXEL_HEIGHT, GRID_SMALL_COLOR);
    }
}

void EcgScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_ECG].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_ECG].status = SCREEN_STATUS_CREATED;

		LCD_Clear(BLACK);
		IdleShowSignal();
		IdleShowNetMode();
		IdleShowBatSoc();
		// Reset lead status and display phase when entering ECG screen
		g_ecg_lead_status = ECG_LEAD_STATUS_UNKNOWN;
		g_ecg_display_phase = ECG_DISPLAY_PREPARE;
		g_ecg_lead_on_ready = false;
		g_ecg_lead_off_timeout = false;
		// Stop lead-on/off timers in case they're still running from a previous session
		k_timer_stop(&ecg_lead_on_timer);
		k_timer_stop(&ecg_lead_off_timer);
		// Disable waveform drawing during prepare phase
		g_ecg_display_active = false;
		EcgShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_SIG)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_SIG);
			IdleShowSignal();
		}
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_NET_MODE)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_NET_MODE);	
			IdleShowNetMode();
		}
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_BAT)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_BAT);
			IdleUpdateBatSoc();
		}
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_BP)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_BP);
			EcgUpdateStatus();
		}
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_ECG_TIMER)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_ECG_TIMER);
			EcgShowCountdown();
		}
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_ECG_LEAD)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_ECG_LEAD);

			if(g_ecg_display_phase == ECG_DISPLAY_PREPARE && g_ecg_lead_on_ready)
			{
				// Switch to waveform display after 2s lead on detected	
				g_ecg_display_phase = ECG_DISPLAY_WAVE;
				// Enable waveform drawing
				g_ecg_display_active = true;
				LCD_Clear(BLACK);
				IdleShowSignal();
				IdleShowNetMode();
				IdleShowBatSoc();
				EcgDisplayInit();
			}
			else if(g_ecg_display_phase == ECG_DISPLAY_WAVE && g_ecg_lead_off_timeout)
			{
				// Lead off for 1s during waveform display, return to prepare screen
				g_ecg_display_active = false;
				g_ecg_display_phase = ECG_DISPLAY_PREPARE;
				g_ecg_lead_on_ready = false;
				g_ecg_lead_off_timeout = false;

				// Stop countdown timer and clear waveform state
				k_timer_stop(&ecg_countdown_timer);
				EcgDisplayDeinit();

				// Reset waveform drawing state
				s_ecg_wave_x = ECG_WAVE_X_START;
				s_ecg_prev_x = ECG_WAVE_X_START;
				s_ecg_prev_y = ECG_WAVE_Y_START + (uint16_t)(ECG_WAVE_HEIGHT * 0.5);

				for (uint16_t i = 0; i < ECG_WAVE_HISTORY_SIZE; i++) {
					ecg_wave_y_history[i] = ECG_WAVE_Y_INVALID;
					ecg_wave_prev_x_history[i] = ECG_WAVE_Y_INVALID;
					ecg_wave_prev_y_history[i] = ECG_WAVE_Y_INVALID;
				}

				ecg_local_read_idx = 0;
				ecg_local_write_idx = 0;

				// Show prepare screen UI
				LCD_Clear(BLACK);
				IdleShowSignal();
				IdleShowNetMode();
				IdleShowBatSoc();
				EcgShowStatus();
			}
			else if(g_ecg_display_phase == ECG_DISPLAY_WAVE)
			{
				EcgShowLeadStatus();
			}
		}
		break;
	}
	
	scr_msg[SCREEN_ID_ECG].act = SCREEN_ACTION_NO;
}

// ECG倒计时定时器回调 - 只减少计数，不操作LCD
static void EcgCountdownTimerCallBack(struct k_timer *timer_id)
{
    if (s_ecg_countdown_seconds > 0) {
        s_ecg_countdown_seconds--;
        // 只在ECG屏幕可见时发送更新事件
        if (screen_id == SCREEN_ID_ECG) {
            scr_msg[SCREEN_ID_ECG].act = SCREEN_ACTION_UPDATE;
            scr_msg[SCREEN_ID_ECG].para |= SCREEN_EVENT_UPDATE_ECG_TIMER;  
        }
    }
    
    // 如果倒计时结束，停止定时器并发送停止测量命令
    if (s_ecg_countdown_seconds == 0) {
        k_timer_stop(&ecg_countdown_timer);
        MenuStopECG();
    }
}

// 导联脱落快速通道立即冻结波形绘制：置位g_ecg_display_active为false，
// 使正在/即将进入EcgDisplayProcessData的路径在入口处立即return，
// 避免脱落过渡期的乱波数据被继续绘制到屏幕上造成"花屏"观感。
// 可在ISR或主循环上下文调用（仅写入volatile标志，安全）。
void EcgHaltDisplay(void)
{
	g_ecg_display_active = false;
}

void ExitEcgScreen(void)
{
	LOGD("Exit ECG screen");

	// 立即禁用ECG绘制，阻断正在进行的EcgDisplayProcessData
	g_ecg_display_active = false;

	// 停止导联检测定时器
	k_timer_stop(&ecg_lead_on_timer);
	k_timer_stop(&ecg_lead_off_timer);

	// 重置ECG显示阶段和导联检测状态
	g_ecg_display_phase = ECG_DISPLAY_PREPARE;
	g_ecg_lead_on_ready = false;
	g_ecg_lead_off_timeout = false;

	// 停止倒计时定时器
	k_timer_stop(&ecg_countdown_timer);

	// 停止ECG采集
	MenuStopECG();

	// 立即清空UART接收缓存，丢弃可能积压的ECG数据
	ClearUartReceCache();

	// 清理ECG显示（停止画图）
	EcgDisplayDeinit();

	// 重置波形绘制状态
	s_ecg_wave_x = ECG_WAVE_X_START;
	s_ecg_prev_x = ECG_WAVE_X_START;
	s_ecg_prev_y = ECG_WAVE_Y_START + (uint16_t)(ECG_WAVE_HEIGHT * 0.5);
	
