duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
	// 重置波形历史数组
	for (uint16_t i = 0; i < ECG_WAVE_HISTORY_SIZE; i++) {
		ecg_wave_y_history[i] = ECG_WAVE_Y_INVALID;
		ecg_wave_prev_x_history[i] = ECG_WAVE_Y_INVALID;
		ecg_wave_prev_y_history[i] = ECG_WAVE_Y_INVALID;
	}

	ecg_local_read_idx = 0;
	ecg_local_write_idx = 0;

	LCD_Set_BL_Mode(LCD_BL_AUTO);

	// 注意：不要在这里调用 EnterIdleScreen()，
	// 因为 EnterIdleScreen 内部会再次调?? ExitEcgScreen 导致递归栈溢??
	// 界面跳转应该由调用方（按键处理函数）负责
}

static void ExitEcgScreenAndGoIdle(void)
{
	ExitEcgScreen();
	EnterIdleScreen();
}

void EnterEcgScreen(void)
{
	if(screen_id == SCREEN_ID_ECG)
		return;

#ifdef CONFIG_PPG_SUPPORT
	// 整点测量运行中时，与血压界面保持一致：提示"Sensor is running"并退出
	if(PPGIsWorkingTiming())
	{
		notify_infor infor = {0};

		infor.x = 0;
		infor.y = 0;
		infor.w = LCD_WIDTH;
		infor.h = LCD_HEIGHT;
		infor.align = NOTIFY_ALIGN_CENTER;
		infor.type = NOTIFY_TYPE_POPUP;
		infor.img_count = 0;
		StrCpyByID(infor.text, STR_ID_SENSOR_IS_RUNNING);
		DisplayPopUp(infor);
		return;
	}
#endif

	k_timer_stop(&mainmenu_timer);

#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaStop();
#endif
#ifdef CONFIG_TEMP_SUPPORT
	k_timer_stop(&temp_status_timer);
	if(TempIsWorking()&&!TempIsWorkingTiming())
		MenuStopTemp();
#endif
#ifdef CONFIG_PPG_SUPPORT
	k_timer_stop(&ppg_status_timer);
	if(IsInPPGScreen()&&!PPGIsWorkingTiming())
		MenuStopPPG();
#endif

	LCD_Set_BL_Mode(LCD_BL_ALWAYS_ON);

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_ECG;	
	scr_msg[SCREEN_ID_ECG].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_ECG].status = SCREEN_STATUS_CREATING;

	// 准备阶段不启用波形绘制，等导联检测2s ON后再启用
	g_ecg_display_active = false;

#ifdef CONFIG_SYNC_SUPPORT
	SetLeftKeyUpHandler(EnterSyncDataScreen);
#else
	SetLeftKeyUpHandler(EnterSettings);
#endif
	SetRightKeyUpHandler(ExitEcgScreenAndGoIdle);

#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();

#ifdef CONFIG_SYNC_SUPPORT
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSyncDataScreen);
#else
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSettings); 
#endif
 
  #ifdef CONFIG_PPG_SUPPORT
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterBPScreen);
  #elif defined(CONFIG_TEMP_SUPPORT)
  	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterTempScreen);
  #elif defined(CONFIG_IMU_SUPPORT)&&(defined(CONFIG_STEP_SUPPORT)||defined(CONFIG_SLEEP_SUPPORT))
   #ifdef CONFIG_SLEEP_SUPPORT
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSleepScreen);
   #elif defined(CONFIG_STEP_SUPPORT)
  	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterStepsScreen);
   #endif
  #else
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterIdleScreen);
  #endif
#endif
	// 直接启动ECG测量
	MenuStartECG(global_settings.wear_way);
}

#endif

#ifdef CONFIG_TEMP_SUPPORT
static uint8_t img_flag = 0;
static uint8_t temp_retry_left = 2;
static uint8_t tempdata[TEMP_REC2_MAX_DAILY*sizeof(temp_rec2_nod)] = {0};

void TempShowNumByImg(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t num_img_w, uint32_t *img_addr, uint32_t separa_img_addr, float data)
{
	uint8_t i,count=1;
	uint16_t x1,temp_body;
	uint32_t divisor=10;
	uint16_t img_w,img_h;
	
	if(global_settings.temp_unit == TEMP_UINT_C)
	{
		temp_body = round(data*10.0);
	}
	else
	{
		temp_body = round((32+1.8*data)*10.0);
	}

	while(1)
	{
		if(temp_body/divisor > 0)
		{
			count++;
			divisor = divisor*10;
		}
		else
		{
			divisor = divisor/10;
			break;
		}
	}

	LCD_Fill(x, y, w, h, BLACK);
	LCD_MeasureImage(separa_img_addr, &img_w, &img_h);
	x1 = x;
	if(count == 1)
	{
		LCD_ShowImage(x1, y, img_addr[temp_body/10]);
		x1 += num_img_w;
		LCD_ShowImage(x1, y, separa_img_addr);
		x1 += img_w;
		LCD_ShowImage(x1, y, img_addr[temp_body%10]);
	}
	else
	{
		for(i=0;i<(count+1);i++)
		{
			if(i == count-1)
			{
				LCD_ShowImage(x1, y, separa_img_addr);
				x1 += img_w;
			}
			else
			{
				LCD_ShowImage(x1, y, img_addr[temp_body/divisor]);
				temp_body = temp_body%divisor;
				divisor = divisor/10;
				x1 += num_img_w;
			}
		}
	}
}

static void TempStatusTimerOutCallBack(struct k_timer *timer_id)
{
	if(screen_id == SCREEN_ID_TEMP)
	{
		switch(g_temp_status)
		{
		case TEMP_STATUS_PREPARE:
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TEMP;
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			break;
			
		case TEMP_STATUS_MEASURING:
			if(get_temp_ok_flag)
			{
				g_temp_status = TEMP_STATUS_MEASURE_OK;
			}
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TEMP;
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			break;
			
		case TEMP_STATUS_MEASURE_FAIL:
			if(temp_retry_left > 0)
			{
				g_temp_status = TEMP_STATUS_NOTIFY;
				scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TEMP;
				scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			}
			else
			{
				g_temp_status = TEMP_STATUS_MAX;
				EntryIdleScr();
			}
			break;

		case TEMP_STATUS_MEASURE_OK:
			g_temp_status = TEMP_STATUS_MAX;
			EntryIdleScr();
			break;

		case TEMP_STATUS_NOTIFY:
			g_temp_status = TEMP_STATUS_PREPARE;
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TEMP;
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			break;
		}
	}
}

void TempUpdateStatus(void)
{
	uint8_t i,count=1;
	uint16_t x,y,w,h;
	uint16_t temp_body;
	uint16_t str_id;
	uint32_t divisor=10;
	uint32_t img_anima[3] = {IMG_ID_TEMP_ANI_1,IMG_ID_TEMP_ANI_2,IMG_ID_TEMP_ANI_3};
	uint32_t img_num[10] = {IMG_ID_FONT_70_NUM_0,IMG_ID_FONT_70_NUM_1,IMG_ID_FONT_70_NUM_2,IMG_ID_FONT_70_NUM_3,IMG_ID_FONT_70_NUM_4,
							IMG_ID_FONT_70_NUM_5,IMG_ID_FONT_70_NUM_6,IMG_ID_FONT_70_NUM_7,IMG_ID_FONT_70_NUM_8,IMG_ID_FONT_70_NUM_9};
	uint32_t img_small_num[10] = {IMG_ID_FONT_45_NUM_0,IMG_ID_FONT_45_NUM_1,IMG_ID_FONT_45_NUM_2,IMG_ID_FONT_45_NUM_3,IMG_ID_FONT_45_NUM_4,
								  IMG_ID_FONT_45_NUM_5,IMG_ID_FONT_45_NUM_6,IMG_ID_FONT_45_NUM_7,IMG_ID_FONT_45_NUM_8,IMG_ID_FONT_45_NUM_9};

