duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
		#ifdef LCD_EQTAC175T1371_CO5300
			LCD_Fill(notify_msg.x+2, notify_msg.y+2, notify_msg.w-2, (notify_msg.h*2)/3-2, BLACK);
		#else
			LCD_Fill(notify_msg.x+2, notify_msg.y+2, notify_msg.w-4, (notify_msg.h*2)/3-4, BLACK);
		#endif
			
			if(notify_msg.img != NULL && notify_msg.img_count > 0)
			{	
				LCD_MeasureImage(notify_msg.img[0], &w, &h);
			#ifdef CONFIG_ANIMATION_SUPPORT
				AnimaShow(notify_msg.x+(notify_msg.w-w)/2, notify_msg.y+(notify_msg.h-h)/2, notify_msg.img, notify_msg.img_count, 500, true, NULL);
			#else
				LCD_ShowImage(notify_msg.x+(notify_msg.w-w)/2, notify_msg.y+(notify_msg.h-h)/2, notify_msg.img[0]);
			#endif
			}
		}
		
		if(scr_msg[SCREEN_ID_NOTIFY].para&SCREEN_EVENT_UPDATE_POP_STR)
		{
			scr_msg[SCREEN_ID_NOTIFY].para &= (~SCREEN_EVENT_UPDATE_POP_STR);

		#ifdef LCD_EQTAC175T1371_CO5300
			LCD_Fill(notify_msg.x+2, str_y+2, notify_msg.w-2, str_h-2, BLACK);
		#else
			LCD_Fill(notify_msg.x+2, str_y+2, notify_msg.w-4, str_h-4, BLACK);
		#endif
			LCD_MeasureUniString(notify_msg.text, &w, &h);
			if(w > (str_w-2*offset_w))
			{
				uint8_t line_count,line_no,line_max;
				uint16_t line_h=(h+offset_h);
				uint16_t byte_no=0,text_len;

				line_max = (str_h-2*offset_h)/line_h;
				line_count = w/(str_w-2*offset_w) + ((w%(str_w-offset_w) != 0)? 1 : 0);
				if(line_count > line_max)
					line_count = line_max;

				line_no = 0;
				text_len = mmi_ucs2strlen(notify_msg.text);
				y = ((str_h-2*offset_h)-line_count*line_h)/2;
				y += (str_y+offset_h);
				while(line_no < line_count)
				{
					uint16_t tmpbuf[128] = {0};
					uint8_t i=0;

					tmpbuf[i++] = notify_msg.text[byte_no++];
					LCD_MeasureUniString(tmpbuf, &w, &h);
					while(w < (str_w-2*offset_w))
					{
						if(byte_no < text_len)
						{
							tmpbuf[i++] = notify_msg.text[byte_no++];
							LCD_MeasureUniString(tmpbuf, &w, &h);
						}
						else
							break;
					}

					if(w >= (str_w-2*offset_w))
					{
						i--;
						byte_no--;
						tmpbuf[i] = 0x00;

						LCD_MeasureUniString(tmpbuf, &w, &h);
					#ifdef LANGUAGE_AR_ENABLE	
						if(g_language_r2l)
							x = str_x+(str_w+w)/2;
						else
					#endif		
							x = str_x+(str_w-w)/2;
						LCD_SmartShowUniString(x, y, tmpbuf);
						
						y += line_h;
						line_no++;
					}
					else
					{
						LCD_MeasureUniString(tmpbuf, &w, &h);
					#ifdef LANGUAGE_AR_ENABLE	
						if(g_language_r2l)
							x = str_x+(str_w+w)/2;
						else
					#endif		
							x = str_x+(str_w-w)/2;
						LCD_SmartShowUniString(x, y, tmpbuf);
						break;
					}
				}
			}
			else if(w > 0)
			{
			#ifdef LANGUAGE_AR_ENABLE	
				if(g_language_r2l)
					x = str_x+(str_w+w)/2;
				else
			#endif		
					x = str_x+(str_w-w)/2;
				y = (h > (str_h-2*offset_h))? 0 : ((str_h-2*offset_h)-h)/2;
				
				LCD_SmartShowUniString(x, y, notify_msg.text);			
			}
		}
		break;
		
	case NOTIFY_ALIGN_BOUNDARY:
	#ifdef LCD_EQTAC175T1371_CO5300
		LCD_Fill(notify_msg.x+2, notify_msg.y+2, notify_msg.w-2, (notify_msg.h*2)/3-2, BLACK);
	#else
		LCD_Fill(notify_msg.x+2, notify_msg.y+2, notify_msg.w-4, (notify_msg.h*2)/3-4, BLACK);
	#endif

	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStringRtoLInRect(notify_msg.x+notify_msg.w-offset_w, notify_msg.y+offset_h, (notify_msg.w-2*offset_w), (notify_msg.h-2*offset_h), notify_msg.text);
		else
	#endif		
			LCD_ShowUniStringInRect(notify_msg.x+offset_w, notify_msg.y+offset_h, (notify_msg.w-2*offset_w), (notify_msg.h-2*offset_h), notify_msg.text);
		break;
	}
}

void NotifyShow(void)
{
	uint16_t x,y,w=0,h=0;
	uint16_t offset_w=8,offset_h=8;

	if(((notify_msg.img == NULL) || (notify_msg.img_count == 0)) 
		&& ((notify_msg.x != 0)&&(notify_msg.y != 0)&&((notify_msg.w != LCD_WIDTH))&&(notify_msg.h != LCD_HEIGHT)))
	{
		LCD_DrawRectangle(notify_msg.x, notify_msg.y, notify_msg.w, notify_msg.h);
	}

#ifdef LCD_EQTAC175T1371_CO5300
	LCD_Fill(notify_msg.x+2, notify_msg.y+2, notify_msg.w-2, notify_msg.h-2, BLACK);
#else
	LCD_Fill(notify_msg.x+2, notify_msg.y+2, notify_msg.w-4, notify_msg.h-4, BLACK);
#endif

	str_x = notify_msg.x;
	str_y = notify_msg.y;
	str_w = notify_msg.w;
	str_h = notify_msg.h;
		
	if(notify_msg.img != NULL && notify_msg.img_count > 0)
	{	
		LCD_MeasureImage(notify_msg.img[0], &w, &h);
	#ifdef CONFIG_ANIMATION_SUPPORT
		AnimaShow(notify_msg.x+(notify_msg.w-w)/2, notify_msg.y+(notify_msg.h-h)/2, notify_msg.img, notify_msg.img_count, 500, true, NULL);
	#else
		LCD_ShowImage(notify_msg.x+(notify_msg.w-w)/2, notify_msg.y+(notify_msg.h-h)/2, notify_msg.img[0]);
	#endif

		str_y = notify_msg.y+(notify_msg.h*2/3);
		str_h = notify_msg.h*1/3;
	}

	switch(notify_msg.align)
	{
	case NOTIFY_ALIGN_CENTER:
		LCD_MeasureUniString(notify_msg.text, &w, &h);
		if(w > (str_w-2*offset_w))
		{
			uint8_t line_count,line_no,line_max;
			uint16_t line_h=(h+offset_h);
			uint16_t byte_no=0,text_len;

			line_max = (str_h-2*offset_h)/line_h;
			line_count = w/(str_w-2*offset_w) + ((w%(str_w-offset_w) != 0)? 1 : 0);
			if(line_count > line_max)
				line_count = line_max;

			line_no = 0;
			text_len = mmi_ucs2strlen(notify_msg.text);
			y = ((str_h-2*offset_h)-line_count*line_h)/2;
			y += (str_y+offset_h);
			while(line_no < line_count)
			{
				uint16_t tmpbuf[128] = {0};
				uint8_t i=0;

				tmpbuf[i++] = notify_msg.text[byte_no++];
				LCD_MeasureUniString(tmpbuf, &w, &h);
				while(w < (str_w-2*offset_w))
				{
					if(byte_no < text_len)
					{
						tmpbuf[i++] = notify_msg.text[byte_no++];
						LCD_MeasureUniString(tmpbuf, &w, &h);
					}
					else
						break;
				}

				if(w >= (str_w-2*offset_w))
				{
					i--;
					byte_no--;
					tmpbuf[i] = 0x00;

					LCD_MeasureUniString(tmpbuf, &w, &h);
				#ifdef LANGUAGE_AR_ENABLE	
					if(g_language_r2l)
						x = str_x+(str_w+w)/2;
					else
				#endif		
						x = str_x+(str_w-w)/2;
					LCD_SmartShowUniString(x, y, tmpbuf);
					
					y += line_h;
					line_no++;
				}
				else
				{
					LCD_MeasureUniString(tmpbuf, &w, &h);
				#ifdef LANGUAGE_AR_ENABLE	
					if(g_language_r2l)
						x = str_x+(str_w+w)/2;
					else
				#endif		
						x = str_x+(str_w-w)/2;
					LCD_SmartShowUniString(x, y, tmpbuf);
					break;
				}
			}
		}
		else if(w > 0)
		{
		#ifdef LANGUAGE_AR_ENABLE	
			if(g_language_r2l)
				x = str_x+(str_w+w)/2;
			else
		#endif		
				x = str_x+(str_w-w)/2;
			y = (h > (str_h-2*offset_h))? 0 : ((str_h-2*offset_h)-h)/2;
			
			LCD_SmartShowUniString(x, y, notify_msg.text);
		}
		break;
		
