duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
	case NOTIFY_ALIGN_BOUNDARY:
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStringRtoLInRect(notify_msg.x+notify_msg.w-offset_w, str_y+offset_h, (notify_msg.w-2*offset_w), (str_h-2*offset_h), notify_msg.text);
		else
	#endif		
			LCD_ShowUniStringInRect(notify_msg.x+offset_w, str_y+offset_h, (notify_msg.w-2*offset_w), (str_h-2*offset_h), notify_msg.text);
		break;
	}
}

void NotifyScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_NOTIFY].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_NOTIFY].status = SCREEN_STATUS_CREATED;
				
		NotifyShow();
		break;
		
	case SCREEN_ACTION_UPDATE:
		NotifyUpdate();
		break;

	case SCREEN_ACTION_EXIT:
		ExitNotifyScreen();
		break;
	}
	
	scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
}

#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
void DlShowStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t str_title[128] = {0};

	LCD_Clear(BLACK);

	switch(g_dl_data_type)
	{
	case DL_DATA_IMG:
	#ifdef FONTMAKER_UNICODE_FONT
		switch(global_settings.language)
		{
	 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JA_ENABLE)||defined(LANGUAGE_KR_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
	  	case LANGUAGE_CN:
	   #endif
	   #ifdef LANGUAGE_JA_ENABLE
	  	case LANGUAGE_JA:
	   #endif
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
	   #endif
			StrSmartCpyByID(str_title, STR_ID_UI_UPGRADE, 16);
			break;
	 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
	  
		default:
			StrSmartCpyByID(str_title, STR_ID_UI_UPGRADE, 18);
			break;
		}
	#else
		strcpy(str_title, "UI Upgrade");
	#endif
		break;
	
	case DL_DATA_FONT:
	#ifdef FONTMAKER_UNICODE_FONT
		switch(global_settings.language)
		{
	 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JA_ENABLE)||defined(LANGUAGE_KR_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
	  	case LANGUAGE_CN:
	   #endif
	   #ifdef LANGUAGE_JA_ENABLE
	  	case LANGUAGE_JA:
	   #endif
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
	   #endif		
			StrSmartCpyByID(str_title, STR_ID_FONT_UPGRADE, 16);
			break;
	 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
	  
		default:
			StrSmartCpyByID(str_title, STR_ID_FONT_UPGRADE, 18);
			break;
		}
	#else
		strcpy(str_title, "FONT Upgrade");
	#endif
		break;
	
	case DL_DATA_STR:
	#ifdef FONTMAKER_UNICODE_FONT
		switch(global_settings.language)
		{
	 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JA_ENABLE)||defined(LANGUAGE_KR_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
	  	case LANGUAGE_CN:
	   #endif
	   #ifdef LANGUAGE_JA_ENABLE
	  	case LANGUAGE_JA:
	   #endif
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
	   #endif		
			StrSmartCpyByID(str_title, STR_ID_STR_UPGRADE, 16);
			break;
	 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
	  
		default:
			StrSmartCpyByID(str_title, STR_ID_STR_UPGRADE, 18);
			break;
		}
	#else
		strcpy(str_title, "STR Upgrade");
	#endif
		break;
	
	case DL_DATA_PPG:
	#ifdef FONTMAKER_UNICODE_FONT
		switch(global_settings.language)
		{
	 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JA_ENABLE)||defined(LANGUAGE_KR_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
	  	case LANGUAGE_CN:
	   #endif
	   #ifdef LANGUAGE_JA_ENABLE
	  	case LANGUAGE_JA:
	   #endif
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
	   #endif
			StrSmartCpyByID(str_title, STR_ID_PPG_ALGORITHM_UPGRADE, 16);
			break;
	 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
	  
		default:
			StrSmartCpyByID(str_title, STR_ID_PPG_ALGORITHM_UPGRADE, 18);
			break;
		}
	#else
		strcpy(str_title, "PPG_AG Upgrade");
	#endif
		break;
	}

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else	
	LCD_SetFontSize(FONT_SIZE_16);
#endif

#ifdef FONTMAKER_UNICODE_FONT
	LCD_MeasureUniString((uint16_t*)str_title, &w, &h);
	y = 25;
  #ifdef LANGUAGE_AR_ENABLE	
	if(g_language_r2l)
	{
		x = (w > (DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W))? (LCD_WIDTH-1) : (LCD_WIDTH+w)/2;
		LCD_ShowUniStringRtoL(x, y, (uint16_t*)str_title);
	}
	else
  #endif		
	{
		x = (w > (DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W))? 0 : (LCD_WIDTH-w)/2;
		LCD_ShowUniString(x, y, (uint16_t*)str_title);
	}
#else
	LCD_MeasureString(str_title, &w, &h);
	x = (w > (DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W))? 0 : ((DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W)-w)/2;
	x += (DL_NOTIFY_RECT_X+DL_NOTIFY_OFFSET_W);
	y = 25;
	LCD_ShowString(x,y,str_title);
#endif

#ifdef FONTMAKER_UNICODE_FONT
  #ifdef LANGUAGE_AR_ENABLE
	if(g_language_r2l)
		LCD_AdaptShowUniStrRtoLInRect(LCD_WIDTH-DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, STR_ID_MAKESURE_BAT_SOC, SHOW_ALIGN_BOUNDARY, SHOW_ALIGN_BOUNDARY);
	else
  #endif
		LCD_AdaptShowUniStrInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, STR_ID_MAKESURE_BAT_SOC, SHOW_ALIGN_BOUNDARY, SHOW_ALIGN_BOUNDARY);
#else
	ShowStringsInRect(DL_NOTIFY_STRING_X, 
					  DL_NOTIFY_STRING_Y, 
					  DL_NOTIFY_STRING_W, 
					  DL_NOTIFY_STRING_H, 
					  "Make sure the battery is more than 80% full or the charger is connected.");
#endif
	LCD_DrawRectangle(DL_NOTIFY_YES_X, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_W, DL_NOTIFY_YES_H);
	LCD_MeasureString("SOS(Y)", &w, &h);
	x = DL_NOTIFY_YES_X+(DL_NOTIFY_YES_W-w)/2;
	y = DL_NOTIFY_YES_Y+(DL_NOTIFY_YES_H-h)/2;	
	LCD_ShowString(x,y,"SOS(Y)");

	LCD_DrawRectangle(DL_NOTIFY_NO_X, DL_NOTIFY_NO_Y, DL_NOTIFY_NO_W, DL_NOTIFY_NO_H);
	LCD_MeasureString("PWR(N)", &w, &h);
	x = DL_NOTIFY_NO_X+(DL_NOTIFY_NO_W-w)/2;
	y = DL_NOTIFY_NO_Y+(DL_NOTIFY_NO_H-h)/2;	
	LCD_ShowString(x,y,"PWR(N)");

	SetRightKeyUpHandler(dl_start);
	SetLeftKeyUpHandler(dl_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_YES_X, DL_NOTIFY_YES_X+DL_NOTIFY_YES_W, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_Y+DL_NOTIFY_YES_H, dl_start);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_NO_X, DL_NOTIFY_NO_X+DL_NOTIFY_NO_W, DL_NOTIFY_NO_Y, DL_NOTIFY_NO_Y+DL_NOTIFY_NO_H, dl_exit);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_exit);
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_prev);
#endif

	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(5), K_NO_WAIT);
}

void DlUpdateStatus(void)
{
	uint16_t pro_len;
	uint16_t x,y,w,h;
	uint8_t pro_buf[16] = {0};
	uint8_t strbuf[256] = {0};
	static bool flag = false;
	static uint16_t pro_str_x,pro_str_y;
	
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif

	switch(get_dl_status())
	{
	case DL_STATUS_PREPARE:
		flag = false;
		break;
		
	case DL_STATUS_LINKING:
		{
			LCD_Fill(DL_NOTIFY_RECT_X+1, DL_NOTIFY_STRING_Y, DL_NOTIFY_RECT_W-1, DL_NOTIFY_RECT_H-(DL_NOTIFY_STRING_Y-DL_NOTIFY_RECT_Y)-1, BLACK);
		#ifdef FONTMAKER_UNICODE_FONT
		  #ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
				LCD_ShowUniStrRtoLInRect(LCD_WIDTH-DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, STR_ID_FW_LINKING_TO_SERVER);
			else
		  #endif
				LCD_ShowUniStrInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, STR_ID_FW_LINKING_TO_SERVER);
		#else
			ShowStringsInRect(DL_NOTIFY_STRING_X,
						  DL_NOTIFY_STRING_Y,
						  DL_NOTIFY_STRING_W,
						  DL_NOTIFY_STRING_H,
						  "Linking to server...");
		#endif
			ClearAllKeyHandler();
		}
		break;
		
	case DL_STATUS_DOWNLOADING:
		if(!flag)
		{
			flag = true;
			
			LCD_Fill(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, BLACK);
		#ifdef FONTMAKER_UNICODE_FONT
		  #ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
				LCD_ShowUniStrRtoLInRect(LCD_WIDTH-DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, STR_ID_FW_DOWNLOADING_DATA);
			else
		  #endif
				LCD_ShowUniStrInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, STR_ID_FW_DOWNLOADING_DATA);
		#else
			ShowStringsInRect(DL_NOTIFY_STRING_X, 
							  DL_NOTIFY_STRING_Y,
							  DL_NOTIFY_STRING_W,
							  40,
							  "Upgrading...");
		#endif
			LCD_DrawRectangle(DL_NOTIFY_PRO_X, DL_NOTIFY_PRO_Y, DL_NOTIFY_PRO_W, DL_NOTIFY_PRO_H);

			sprintf(pro_buf, "%d%%", g_dl_progress);
			memset(strbuf, 0x00, sizeof(strbuf));
			mmi_asc_to_ucs2(strbuf, pro_buf);
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			pro_str_x = DL_NOTIFY_PRO_NUM_X+(DL_NOTIFY_PRO_NUM_W-w)/2;
			pro_str_y = DL_NOTIFY_PRO_NUM_Y+(DL_NOTIFY_PRO_NUM_H-h)/2;
			LCD_ShowUniString(pro_str_x,pro_str_y, (uint16_t*)strbuf);
		}
		else
		{
			pro_len = (g_dl_progress*DL_NOTIFY_PRO_W)/100;
			LCD_Fill(DL_NOTIFY_PRO_X+1, DL_NOTIFY_PRO_Y+1, pro_len, DL_NOTIFY_PRO_H-1, WHITE);

			sprintf(pro_buf, "%d%%", g_dl_progress);
			memset(strbuf, 0x00, sizeof(strbuf));
			mmi_asc_to_ucs2(strbuf, pro_buf);
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			LCD_ShowUniString(pro_str_x,pro_str_y, (uint16_t*)strbuf);
		}

		ClearAllKeyHandler();
		break;
		
